7767517
175 195
Input            input0                   0 1 input0
Convolution      331                      1 1 input0 331 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
HardSwish        338                      1 1 331 338 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_0              1 2 338 338_splitncnn_0 338_splitncnn_1
ConvolutionDepthWise 339                      1 1 338_splitncnn_1 339 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             341                      1 1 339 341
Convolution      342                      1 1 341 342 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
BinaryOp         344                      2 1 338_splitncnn_0 342 344 0=0
Convolution      345                      1 1 344 345 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             347                      1 1 345 347
ConvolutionDepthWise 348                      1 1 347 348 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             350                      1 1 348 350
Convolution      351                      1 1 350 351 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Split            splitncnn_1              1 2 351 351_splitncnn_0 351_splitncnn_1
Convolution      353                      1 1 351_splitncnn_1 353 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
ReLU             355                      1 1 353 355
ConvolutionDepthWise 356                      1 1 355 356 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=648 7=72
ReLU             358                      1 1 356 358
Convolution      359                      1 1 358 359 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
BinaryOp         361                      2 1 351_splitncnn_0 359 361 0=0
Split            splitncnn_2              1 2 361 361_splitncnn_0 361_splitncnn_1
Convolution      362                      1 1 361_splitncnn_1 362 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
ReLU             364                      1 1 362 364
ConvolutionDepthWise 365                      1 1 364 365 0=72 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
Split            splitncnn_3              1 2 365 365_splitncnn_0 365_splitncnn_1
Pooling          373                      1 1 365_splitncnn_1 373 0=1 4=1
Reshape          377                      1 1 373 377 0=72
InnerProduct     378                      1 1 377 378 0=24 1=1 2=1728
ReLU             379                      1 1 378 379
InnerProduct     380                      1 1 379 380 0=72 1=1 2=1728
HardSigmoid      385                      1 1 380 385 0=1.666667e-01 1=5.000000e-01
Reshape          393                      1 1 385 393 0=1 1=1 2=72
BinaryOp         394                      2 1 365_splitncnn_0 393 394 0=2
ReLU             395                      1 1 394 395
Convolution      396                      1 1 395 396 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_4              1 2 396 396_splitncnn_0 396_splitncnn_1
Convolution      398                      1 1 396_splitncnn_1 398 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
ReLU             400                      1 1 398 400
ConvolutionDepthWise 401                      1 1 400 401 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
Split            splitncnn_5              1 2 401 401_splitncnn_0 401_splitncnn_1
Pooling          409                      1 1 401_splitncnn_1 409 0=1 4=1
Reshape          413                      1 1 409 413 0=96
InnerProduct     414                      1 1 413 414 0=24 1=1 2=2304
ReLU             415                      1 1 414 415
InnerProduct     416                      1 1 415 416 0=96 1=1 2=2304
HardSigmoid      421                      1 1 416 421 0=1.666667e-01 1=5.000000e-01
Reshape          429                      1 1 421 429 0=1 1=1 2=96
BinaryOp         430                      2 1 401_splitncnn_0 429 430 0=2
ReLU             431                      1 1 430 431
Convolution      432                      1 1 431 432 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
BinaryOp         434                      2 1 396_splitncnn_0 432 434 0=0
Split            splitncnn_6              1 2 434 434_splitncnn_0 434_splitncnn_1
Convolution      435                      1 1 434_splitncnn_1 435 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
ReLU             437                      1 1 435 437
ConvolutionDepthWise 438                      1 1 437 438 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
Split            splitncnn_7              1 2 438 438_splitncnn_0 438_splitncnn_1
Pooling          446                      1 1 438_splitncnn_1 446 0=1 4=1
Reshape          450                      1 1 446 450 0=96
InnerProduct     451                      1 1 450 451 0=24 1=1 2=2304
ReLU             452                      1 1 451 452
InnerProduct     453                      1 1 452 453 0=96 1=1 2=2304
HardSigmoid      458                      1 1 453 458 0=1.666667e-01 1=5.000000e-01
Reshape          466                      1 1 458 466 0=1 1=1 2=96
BinaryOp         467                      2 1 438_splitncnn_0 466 467 0=2
ReLU             468                      1 1 467 468
Convolution      469                      1 1 468 469 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
BinaryOp         471                      2 1 434_splitncnn_0 469 471 0=0
Split            splitncnn_8              1 2 471 471_splitncnn_0 471_splitncnn_1
Convolution      472                      1 1 471_splitncnn_1 472 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
HardSwish        479                      1 1 472 479 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 480                      1 1 479 480 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
HardSwish        487                      1 1 480 487 0=1.666667e-01 1=5.000000e-01
Convolution      488                      1 1 487 488 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_9              1 2 488 488_splitncnn_0 488_splitncnn_1
Convolution      490                      1 1 488_splitncnn_1 490 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=10240
HardSwish        497                      1 1 490 497 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 498                      1 1 497 498 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1440 7=160
HardSwish        505                      1 1 498 505 0=1.666667e-01 1=5.000000e-01
Convolution      506                      1 1 505 506 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=10240
BinaryOp         508                      2 1 488_splitncnn_0 506 508 0=0
Split            splitncnn_10             1 2 508 508_splitncnn_0 508_splitncnn_1
Convolution      509                      1 1 508_splitncnn_1 509 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
HardSwish        516                      1 1 509 516 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 517                      1 1 516 517 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
HardSwish        524                      1 1 517 524 0=1.666667e-01 1=5.000000e-01
Convolution      525                      1 1 524 525 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
BinaryOp         527                      2 1 508_splitncnn_0 525 527 0=0
Split            splitncnn_11             1 2 527 527_splitncnn_0 527_splitncnn_1
Convolution      528                      1 1 527_splitncnn_1 528 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
HardSwish        535                      1 1 528 535 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 536                      1 1 535 536 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
HardSwish        543                      1 1 536 543 0=1.666667e-01 1=5.000000e-01
Convolution      544                      1 1 543 544 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
BinaryOp         546                      2 1 527_splitncnn_0 544 546 0=0
Convolution      547                      1 1 546 547 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
HardSwish        554                      1 1 547 554 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 555                      1 1 554 555 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Split            splitncnn_12             1 2 555 555_splitncnn_0 555_splitncnn_1
Pooling          563                      1 1 555_splitncnn_1 563 0=1 4=1
Reshape          567                      1 1 563 567 0=384
InnerProduct     568                      1 1 567 568 0=96 1=1 2=36864
ReLU             569                      1 1 568 569
InnerProduct     570                      1 1 569 570 0=384 1=1 2=36864
HardSigmoid      575                      1 1 570 575 0=1.666667e-01 1=5.000000e-01
Reshape          583                      1 1 575 583 0=1 1=1 2=384
BinaryOp         584                      2 1 555_splitncnn_0 583 584 0=2
HardSwish        590                      1 1 584 590 0=1.666667e-01 1=5.000000e-01
Convolution      591                      1 1 590 591 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=33792
Split            splitncnn_13             1 2 591 591_splitncnn_0 591_splitncnn_1
Convolution      593                      1 1 591_splitncnn_1 593 0=528 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=46464
HardSwish        600                      1 1 593 600 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 601                      1 1 600 601 0=528 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4752 7=528
Split            splitncnn_14             1 2 601 601_splitncnn_0 601_splitncnn_1
Pooling          609                      1 1 601_splitncnn_1 609 0=1 4=1
Reshape          613                      1 1 609 613 0=528
InnerProduct     614                      1 1 613 614 0=136 1=1 2=71808
ReLU             615                      1 1 614 615
InnerProduct     616                      1 1 615 616 0=528 1=1 2=71808
HardSigmoid      621                      1 1 616 621 0=1.666667e-01 1=5.000000e-01
Reshape          629                      1 1 621 629 0=1 1=1 2=528
BinaryOp         630                      2 1 601_splitncnn_0 629 630 0=2
HardSwish        636                      1 1 630 636 0=1.666667e-01 1=5.000000e-01
Convolution      637                      1 1 636 637 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=46464
BinaryOp         639                      2 1 591_splitncnn_0 637 639 0=0
Split            splitncnn_15             1 2 639 639_splitncnn_0 639_splitncnn_1
Convolution      640                      1 1 639_splitncnn_1 640 0=528 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=46464
HardSwish        647                      1 1 640 647 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 648                      1 1 647 648 0=528 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=13200 7=528
Split            splitncnn_16             1 2 648 648_splitncnn_0 648_splitncnn_1
Pooling          656                      1 1 648_splitncnn_1 656 0=1 4=1
Reshape          660                      1 1 656 660 0=528
InnerProduct     661                      1 1 660 661 0=136 1=1 2=71808
ReLU             662                      1 1 661 662
InnerProduct     663                      1 1 662 663 0=528 1=1 2=71808
HardSigmoid      668                      1 1 663 668 0=1.666667e-01 1=5.000000e-01
Reshape          676                      1 1 668 676 0=1 1=1 2=528
BinaryOp         677                      2 1 648_splitncnn_0 676 677 0=2
HardSwish        683                      1 1 677 683 0=1.666667e-01 1=5.000000e-01
Convolution      684                      1 1 683 684 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=63360
Convolution      686                      1 1 684 686 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2880
ReLU             688                      1 1 686 688
Split            splitncnn_17             1 2 688 688_splitncnn_0 688_splitncnn_1
Convolution      689                      1 1 639_splitncnn_0 689 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
ReLU             691                      1 1 689 691
Interp           708                      1 1 688_splitncnn_1 708 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp         709                      2 1 708 691 709 0=0
Convolution      710                      1 1 709 710 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
ReLU             712                      1 1 710 712
Split            splitncnn_18             1 2 712 712_splitncnn_0 712_splitncnn_1
Convolution      713                      1 1 471_splitncnn_0 713 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
ReLU             715                      1 1 713 715
Interp           732                      1 1 712_splitncnn_1 732 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp         733                      2 1 732 715 733 0=0
Convolution      734                      1 1 733 734 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
ReLU             736                      1 1 734 736
Split            splitncnn_19             1 2 736 736_splitncnn_0 736_splitncnn_1
Convolution      737                      1 1 361_splitncnn_0 737 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             739                      1 1 737 739
Interp           756                      1 1 736_splitncnn_1 756 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp         757                      2 1 756 739 757 0=0
Convolution      758                      1 1 757 758 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
ReLU             760                      1 1 758 760
Interp           777                      1 1 736_splitncnn_0 777 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Interp           788                      1 1 712_splitncnn_0 788 0=1 1=4.000000e+00 2=4.000000e+00 6=0
Interp           799                      1 1 688_splitncnn_0 799 0=1 1=8.000000e+00 2=8.000000e+00 6=0
Concat           800                      4 1 760 777 788 799 800 0=0
Convolution      801                      1 1 800 801 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             803                      1 1 801 803
Convolution      804                      1 1 803 804 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=20736
ReLU             806                      1 1 804 806
Deconvolution    807                      1 1 806 807 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=2304
BatchNorm        808                      1 1 807 808 0=24
ReLU             809                      1 1 808 809
Deconvolution    810                      1 1 809 810 0=1 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=96
Sigmoid          out1                     1 1 810 out1
